[
  {
    "testimonial": "Love Bailey’s- our go – to place on a weekly basis – delicious barbecue, attentive staff and service, great atmosphere!! Had the downstairs room for my birthday and it was a fantastic party – everyone loved it – keep up the great work!!! Also love the Bailey’s catered food at the many K of C parties and events!!",
    "author": "Eileen Corry Griffith"
  },
  {
    "testimonial": "HANDS DOWN THE BEST!!! I had baileys cater my wedding yesterday and I absolutely couldn’t be any happier. Paul took such great care of us through the first day we came to him all the way to the very last minute of our weddding day. he treated us like family and was so professional and so well experienced. he took time out of his busy work day to come help set up the day before, along with handling and solving all my wedding issues. EVERY SINGLE PERSON SAID HOW GREAT THE FOOD WAS",
    "author": "Jessie Mikel Jaymes"
  },
  {
    "testimonial": "Yummy dinner for hungry fam… Mac n cheese, baby back ribs; pulled short ribs, smoked sausage, pulled pork, with sides of corn souffle and smoked beans.",
    "author": "Regina Marie Aragon Espino"
  },
  {
    "testimonial": "I had been to Bailey’s several years ago, and the one thing I remembered was that the food was great. I brought my boyfriend here last night, for the first time, and let’s just say, he was not disappointed. We started with the MAC and cheese, pulled pork egg rolls, as an appetizer- . The spare ribs were by far the best ribs I’ve ever had. Pulled pork sandwich was great, my only suggestion would be putting it on a softer roll. Nonetheless, it was still very tasty. Our waitress was excellent- friendly, attentive and had great recommendations. All in all, if you want some good BBQ, go to Baileys!",
    "author": "Maria von Heine-Geldern"
  },
  {
    "testimonial": "I brought my wife kids and mother here for dinner, It was Saturday night and the place was packed. They got us in relatively quick and the food was phenomenal. Look forward to going back. Having one of my children’s birthday parties in August at our house and going to get it catered by Bailey’s.",
    "author": "Peter Clemente"
  }
]
